In [3]:
import pandas as pd
kalori = pd.read_csv('övningsdata.csv')

df= pd.DataFrame(kalori)
df.head()

         Date  Steps  Calories_Burned
0  2025-01-01  10993              421
1  2025-01-02   9723              334
2  2025-01-03  11295              365
3  2025-01-04  13046              479
4  2025-01-05   9531              465

In [9]:
data = { "city":["Stockholm","Göteborg","Malmö"],"temp":[10,17,20], "date":["2024-06-01","2024-06-01","2024-06-01"] }
df2 = pd.DataFrame(data)
df2.head()

        city  temp        date
0  Stockholm    10  2024-06-01
1   Göteborg    17  2024-06-01
2      Malmö    20  2024-06-01

In [16]:
data = {
    "kund_id": [101, 102, 103, 101, 104, 105, 106, 107, 108, 109],
    "datum": [
        "2024-12-28", "2025-01-02", "2025-01-03", "2025-01-05",
        "2025-01-06", "2025-01-08", "2025-01-08", "2025-01-09",
        "2025-01-10", "2025-01-10"
    ],
    "produkt": [
        "Laptop", "Mobilskal", "Hörlurar", "Mus", "Tangentbord",
        "Skärm", "Mobiltelefon", "Webbkamera", "Skrivare", "USB-minne"
    ],
    "kategori": [
        "Elektronik", "Tillbehör", "Ljud", "Tillbehör", "Tillbehör",
        "Elektronik", "Elektronik", "Tillbehör", "Elektronik", "Tillbehör"
    ],
    "pris": [12000, 199, 899, 349, 499, 2200, 8500, 699, 1499, 129],
    "antal": [1, 2, 1, 1, 1, 2, 1, 3, 1, 4],
    "stad": [
        "Stockholm", "Göteborg", "Malmö", "Stockholm", "Uppsala",
        "Stockholm", "Lund", "Göteborg", "Umeå", "Västerås"
    ]
}

df = pd.DataFrame(data)
df.head()
df.describe()

          kund_id          pris     antal
count   10.000000     10.000000  10.00000
mean   104.600000   2697.300000   1.70000
std      2.875181   4113.751655   1.05935
min    101.000000    129.000000   1.00000
25%    102.250000    386.500000   1.00000
50%    104.500000    799.000000   1.00000
75%    106.750000   2024.750000   2.00000
max    109.000000  12000.000000   4.00000

In [14]:
df = df[(df["stad"] == "Stockholm") & (df["datum"] >= "2024-01-01")]
df.head()

   kund_id       datum produkt    kategori   pris  antal       stad
0      101  2024-12-28  Laptop  Elektronik  12000      1  Stockholm
3      101  2025-01-05     Mus   Tillbehör    349      1  Stockholm
5      105  2025-01-08   Skärm  Elektronik   2200      2  Stockholm

In [13]:
df.describe()

          kund_id          pris     antal
count    3.000000      3.000000  3.000000
mean   102.333333   4849.666667  1.333333
std      2.309401   6261.150081  0.577350
min    101.000000    349.000000  1.000000
25%    101.000000   1274.500000  1.000000
50%    101.000000   2200.000000  1.000000
75%    103.000000   7100.000000  1.500000
max    105.000000  12000.000000  2.000000

In [17]:
# Visa färre decimaler
df.describe().round(2)

       kund_id      pris  antal
count    10.00     10.00  10.00
mean    104.60   2697.30   1.70
std       2.88   4113.75   1.06
min     101.00    129.00   1.00
25%     102.25    386.50   1.00
50%     104.50    799.00   1.00
75%     106.75   2024.75   2.00
max     109.00  12000.00   4.00